# Создать строку равную предпоследнему символу введенной строки.
a = "I am learning python" [-2]
print(a)
