# Создать строку равную введенной строку без последних двух символов.
a = "I am learning python" [:-2]
print(a)
