# Создать строку равную третьему символу введенной строки.
a = "I am learning python"[2]
print(a)
