# Создать строку равную первым пяти символам введенной строки.
a = "I am learning python"[0:5]
print(a)
