'''
-------------------------------------------------------------------------------
ЗАДАНИЕ 2.04

Создать два списка a = [1,2,3,4] и b = [ ]
Вывести на экран id a и b
Присвоить b значение a (b=a)
Вывести на экран id переменных
Добавить элемент в список b
Вывести на экран оба списка
-------------------------------------------------------------------------------
'''
a = [1, 2, 3, 4]
b = []

info = (f'\nid(a): {id(a)}\n'
        f'id(b): {id(b)}\n'
        f'id(a) = id(b): {id(a) == id(b)} \n')
print(info)

b = a
info = (f'id(a): {id(a)}\n'
        f'id(b): {id(b)}\n'
        f'id(a) = id(b): {id(a) == id(b)} \n')
print(info)

b.append('new_one')
print(f'\nList a: {a}\nList b: {b}')

a.append('next_one')
print(f'\nList a: {a}\nList b: {b}\n')
