'''
-------------------------------------------------------------------------------
ЗАДАНИЕ 2.01

Создать переменные firstname, lastname, age с соответствующими значениями
Путем сложения получить строку вида: Привет, меня зовут Иван Иванов, мне 35 лет
Примечание: переменную age задавать как строку ‘35’
-------------------------------------------------------------------------------
'''

firstname = 'Иван'
lastname = 'Иванов'
age = '35'

msg = f'\nПривет, меня зовут {firstname} {lastname}, мне {age} лет.\n'
print(msg)
