# Задание 2.03
# Создать список из двух элементов.
# Создать кортеж из двух элементов.
# Создать словарь с одной парой. Ключ - кортеж, значение - список
# Создать словарь с одной парой. Ключ - список, значение - кортеж
avto = ["ford", "honda"]
motor = ("бензин", "дизель")
slvr = {motor: avto}
print(slvr)
slvrt = {("dodge",  "ford"): "USA", "honda": "JAPAN"}
print(slvrt)
print(type(slvrt))
print(list('he'))
print(id(1))
