#Даны два действительных числа. Найти среднее арифметическое и
#среднее геометрическое этих чисел
d = 6
h = 8
print(f" среднее арифметическое = {(d * h)/2}\n"
      f" среднее геометрическое = {(d * h) ** .5}")
