# Дана длина ребра куба. Найти объем куба и площадь его боковой
# поверхности.


a = 5

volume = a ** 3
print(volume)

s = 6 * (a**2)
print(s)
