# Создать строку равную всем элементам введенной строки с четными
# индексами. (считая, что индексация начинается с 0, поэтому символы
# выводятся начиная с первого, индексы 0,2,4,6....).


from main import line


print(line)

line_for_task_1 = line[0::2]
print(line_for_task_1)
