# Создать строку равную первым пяти символам введенной строки.
str1 = "Hello**World"
str2 = str1[0:5]
print(str2)
