# Задание 2_1
# Даны 2 дейтсвительных числа a и b. Получить их сумму, разность и произведение

a = 2
b = 3
summ = a + b
diff = b - a
proizv = a * b
print(summ, diff, proizv)
