# Задание 3_5
# Ввести предложение
# Если в предложении есть слово code - вывести на экран Yes, иначе вывести на экран No

text = 'слово код тут не на английском'
if 'code' in text:
    print('Yes')
else:
    print('No')
