# 4)Создать строку равную введенной строке без последних двух символов.
name = 'Nikita Semiachka'
k = len(name)
print(k)
name1 = name[0:-2]
print(name1)
