# 3)Дана длина ребра куба. Найти объем куба и площадь его боковой
# поверхности.
a = 3
v = a ** 3
print(v)
s = 4 * a ** 2
print(s)
