#Создать строку равную введенной строку без последних двух символов.
st = 'anastasia mila ramy'
hw2_4 = st[0: -2]
print(f" {st} \n {hw2_4} ")
