# Задание 2.01
""" Создать переменные firstname, lastname, age с соответствующими значениями
Путем сложения получить строку вида
Привет, меня зовут Иван Иванов, мне 35 лет
Примечание:
Переменную age задавать как строку '35' """

firstname = 'Иван'
lastname = 'Иванов'
age = '35'
print("Привет, меня зовут {} {}, мне {} лет".format(firstname, lastname, age))
