# 3)Создать строку равную первым пяти символам введенной строки
name = 'Nikita Semiachka'
name1 = name[0:5]
print(name1)
