# Задание 3_5
# Создать строку равную всем элементам введенной строки с четными индексами (0, 2, 4 и т.д.)

text = 'Все начальные данные задаются произвольно'
str_5 = text[0::2]
print(str_5)
