""" Даны два действительных числа.
Найти среднее арифметическое и среднее геометрическое этих чисел."""

x = 3
y = -2
arithmetic_mean = (x + y) / 2
geometric_mean = (x * y) ** (1 / 2)
print(arithmetic_mean, geometric_mean)
