# 1. Создать строку равную третьему символу введенной строки
string = "Hello Python"
string_result = string[2]
print(string_result)
