"""
Написать 12 функций по переводу величин.
"""


def inch_in_sant(a):
    """
    Функция переводит дюймы в сантиметры.
    """
    x = a * 2.54
    print(x)
    return a


def sant_in_inch(a):
    """
    Функция переводит сантиметры в дюймы.
    """
    x = a * 0.3937
    print(x)
    return a


def mille_in_kilometr(a):
    """
    Функция переводит мили в километры.
    """
    x = a * 1.609
    print(x)
    return a


def kilometr_in_mille(a):
    """
    Функция переводит километры в мили.
    """
    x = a * 0.6214
    print(x)
    return a


def funt_in_kg(a):
    """
    Функция переводит фунты в килограммы.
    """
    x = a * 0.4536
    print(x)
    return a


def kg_in_funt(a):
    """
    Функция переводит килограммы в фунты.
    """
    x = a * 2.2046
    print(x)
    return a


def uncia_in_gramm(a):
    """
    Функция переводит унции в граммы.
    """
    x = a * 28.35
    print(x)
    return a


def gramm_in_uncia(a):
    """
    Функция переводит граммы в унции.
    """
    x = a * 0.0353
    print(x)
    return a


def gallon_in_litr(a):
    """
    Функция переводит галлон в литры.
    """
    x = a * 4.546
    print(x)
    return a


def litr_in_gallon(a):
    """
    Функция переводит литры в галлоны.
    """
    x = a * 0.219
    print(x)
    return a


def pint_in_litr(a):
    """
    Функция переводит пинты в литры.
    """
    x = a * 0.568
    print(x)
    return a


def litr_in_pinta(a):
    """
    Функция переводит литры в пинты.
    """
    x = a * 1.759
    print(x)
    return a
