# Задание 2.3
# Ввести строку с клавиатуры.
# Создать строку равную первым пяти символам введенной строки

user_input = input('Input whatever you want: ')

new_str = user_input[:5]
print(new_str)
