# Задание 3_2
# Запросить у пользователя два целых числа
# Вывести строку вида "2 плюс 3 равно 5"
# Примечание: после ввода переменных преобразовать переменные к типу int

num_1 = int(input('Введите первое число: '))
num_2 = int(input('Введите второе число: '))
summ = num_1 + num_2
print(num_1, 'плюс', num_2, 'равно', summ )
