# 2)Создать строку равную предпоследнему символу введенной строки.
name = 'Nikita Semiachka'
name1 = name[-2]
print(name1)
