# Задание 4
# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел.

num_1 = 6
num_2 = 7
arith = (num_1 + num_2) / 2
geom = (num_1 * num_2) * 0.5
print("Average:", arith)
print("Geometric mean:", geom)
