# Дан список. Создать новый список, сдвинутый на 1 элемент влево
# Пример: 1 2 3 4 5 -> 2 3 4 5 1

def list_1():
    list_ = [1, 2, 3, 4, 5]
    element_in_list = list_[0]
    print(element_in_list)


list_1()
