""" Даны действительные числа x  и  y.
Получить (|x|-|y|)/(1+|x*y)"""

x = 3
y = -2
answer = (abs(x) - abs(y)) / (1+abs(x * y))
print(answer)
