#hw1:1
a = 4
b = 2
print(f" сумма = {a + b}\n "
      f"разность = {a - b}\n "
      f"произведение = {a * b}")
#hw1:2
x = 6
y = 3
print((x-y)/((x*y)+1))
#hw1:3
d_r_k = 3
v_k = d_r_k ** 2
s_k = d_r_k * 2
print(f" объем куба = {v_k}\n "
      f"площадь боковой поверхности = {s_k} ")
#hw1:4
d = 6
h = 8
print(f" среднее арифметическое = {(d * h)/2}\n"
      f" среднее геометрическое = {(d * h) ** .5}")
#hw1:5
z = 5
n = z
print(f" гипотенуза треугольника = {((z ** 2) + (n ** 2)) ** .5}\n "
      f"площадь треугольника = {(z * n)/2}")