# Задание 3_1
# Создать строку равную третьему символу введенной строки.

text = 'Все начальные данные задаются произвольно'
str_1 = text[2]
print(str_1)
