# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.


a = 2

b = 4

summa = a + b

print(summa)

difference = a - b

print(difference)

composition = a * b

print(composition)
