# Задание 3_2
# Создать строку равную предпоследнему символу введенной строки

text = 'Все начальные данные задаются произвольно'
str_2 = text[-2]
print(str_2)
