# Задание 2.1
# Ввести строку с клавиатуры.
# Создать строку равную третьему символу введенной строки

user_input = input('Input whatever you want: ')

new_str = user_input[2]
print(new_str)
