# Дан список целых чисел.
# Создать новый список, каждый элемент которого равен исходному элементу
# умноженному на -2

list_1, list_2, i = [1, 2, 3, 4, 5], [], 0

# ------------------------WHILE----------------------------------------

while i < len(list_1):
    a = list_1[i]
    list_2.append(a * -2)
    i += 1
print(list_2)

# -------------------------FOR-----------------------------------------

list_2 = []
for i in range(len(list_1)):
    a = list_1[i]
    list_2.append(a * -2)
print(list_2)
