"""Создать строку равную всем элементам введенной строки с четными
индексами. (считая, что индексация начинается с 0, поэтому символы
выводятся начиная с первого, индексы 0,2,4,6….)."""
st = 'anastasia mila ramy'
hw2_5 = st[0::2]
print(f" {st} \n {hw2_5}")
