#Дана длина ребра куба. Найти объем куба и площадь его боковой
#поверхности.
d_r_k = 3
v_k = d_r_k ** 2
s_k = d_r_k * 2
print(f" объем куба = {v_k}\n "
      f"площадь боковой поверхности = {s_k} ")
