# Создать строку равную первым пяти символам введенной строки.


from main import line


print(line)

line_for_task_1 = line[0:5]
print(line_for_task_1)
