# Задача 1.1
# Даны 2 действительных числа a и b.
# Получить их сумму, разность и произведение.

a = 3.14
b = 71

summa = a + b
sub = a - b
mult = a * b

print(f'a = {a}, b = {b} \n',
      f'a + b = {summa}',
      f'a - b = {sub}',
      f'a * b = {mult}', sep="\n")
