# Задание 3_4
# Создать строку равную введенной строке без последних двух символов

text = 'Все начальные данные задаются произвольно'
str_4 = text[0:-2]
print(str_4)
