# Задание 3
# Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности

L = 3
S = L ** 2
V = L ** 3
print("Square:", S)
print("Volume:", V)
