# Создать строку равную третьему символу введенной строки.
str1 = "Hello World"
str2 = str1[2]
print(str2)
