#3.	Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности.
a = int(input("Введите длина ребра куба a = "))
v = a * a * a
s = 6 * (a * a)
print("Объем куба v = ", v)
print("Площадь боковой поверхности s = ", s)
