# Создать строку равную всем элементам введенной строки с четными индексами.
str1 = "Hello**World5"
str2 = str1[0:len(str1):2]
print(str2)
