#Создать строку равную третьему символу введенной строки.
st = 'anastasia mila ramy'
hw2_1 = st[2]
print(f" {st} \n {hw2_1} ")
