# 2) Даны действительные числа x и y.  Получить (|x| - |y|)/(1+|xy|)
x = 6
y = 8
z = (abs(x) + abs(y)) / (1 + abs(x * y))
print(z)
