# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида
# Привет, меня зовут Иван Иванов, мне 35 лет
# Примечание:
# Переменную age задавать как строку ‘35’


firstname = 'Kate'

lastname = 'Tishevich'

age = '22'

result = f"Хей,я {firstname} {lastname} мне {age} года"

print(result)
