# 1)Создать строку равную третьему символу введенной строки.
name = 'Nikita Semiachka'
print(name)
name1 = name[2]
print(name1)
