#1. Даны 2 действительных числа a и b. Получить их сумму, разность и
#произведение.
a = 4
b = 2
print(f" сумма = {a + b}\n "
      f"разность = {a - b}\n "
      f"произведение = {a * b}")
