# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

name = input()
print('Hello,', name)
