# Дан список. Создать новый список, сдвинутый на 1 элемент влево
x = [7, 8, 9, 10, 11]
while x:
    y = x.pop(0)
    y += 1
    print(y)

y = [7, 8, 9, 10, 11]
for z in y:
    z += 1
    print(z)
