# Задание 2_4
# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел

a = 4
b = 4
sr_arifm = (a + b) / 2
sr_geom = (a * b) ** (1 / 2)
print(sr_arifm, sr_geom)
