# Даны действительные числа x и y. Получить abs(x) - abs(y)) / (1 + abs(x * y)


x = 10
y = 4

z = (abs(x) - abs(y)) / (1 + abs(x * y))

print(z)
