# Задание 3_3
# Создать строку равную первым пяти символам введенной строки

text = 'Все начальные данные задаются произвольно'
str_3 = text[0:5]
print(str_3)
