# Создать строку равную введенной строку без последних двух символов.


from main import line


print(line)

line_for_task_1 = line[:-2]
print(line_for_task_1)
