# Даны два действительных числа. Найти среднее арифметическое и среднее геометрическое этих чисел
a = int(input("Введите первое число a = "))
b = int(input("Введите второе число b = "))
print(f"Среднее арифметическое: {(a + b) / 2},  Среднее геометрическое: {(a * b) ** 1 / 2}")
