# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
a = 5
b = 12
print("Cумма {0}, Разность {1}, Произведение {2}".format(a + b, a - b, a * b))
