#2.	Даны действительные числа x и y. Получить (|x| − |y|)/(1+ |xy|)
x = -4
y = 6
print((abs(x) - abs(y)) / (1 + abs(x * y)))
