# Дан список целых чисел. Подсчитать сколько четных чисел в списке
x = [2, 9, 12, 3, 7]
s = 0
while x:
    y = x.pop(0)
    if y % 2 == 0:
        s += 1
print(s)

b = [4, 9, 12, 3, 7]
n = 0
for i in b:
    if i % 2 == 0:
        n += 1
print(n)
