""" Создать строку равную третьему символу введенной строки."""

string_1 = '01w3456789'
string_2 = string_1[2]
print(string_2)
