"""
Homework - 10
task_10_2: Создать csv файл с данными о ежедневной погоде. Структура: Дата,
Место, Градусы, Скорость ветра. Найти среднюю погоду(скорость ветра и
градусы) для Минск за последние 7 дней.
"""

from csv_utils import average_weather_csv
from csv_utils import write_csv

write_csv([["Дата", "Место", "Градусы", "Скорость ветра"],
           ["09.07.21", "Минск", 30, 5.1],
           ["09.07.21", "Якутск", 20, 15.3],
           ["10.07.21", "Минск", 32, 4.1],
           ["10.07.21", "Якутск", 19, 12.3],
           ["11.07.21", "Минск", 33, 7.1],
           ["11.07.21", "Якутск", 18, 10.3],
           ["12.07.21", "Минск", 35, 9.1],
           ["12.07.21", "Якутск", 19, 9.3],
           ["13.07.21", "Минск", 37, 8.1],
           ["13.07.21", "Якутск", 20, 10.3],
           ["14.07.21", "Минск", 38, 6.1],
           ["14.07.21", "Якутск", 21, 12.3],
           ["15.07.21", "Минск", 39, 9.1],
           ["15.07.21", "Якутск", 20, 11.3],
           ["16.07.21", "Минск", 38, 5.1],
           ["16.07.21", "Якутск", 18, 14.3],
           ["17.07.21", "Минск", 37, 7.1],
           ["17.07.21", "Якутск", 17, 16.3],
           ["18.07.21", "Минск", 38, 6.1],
           ["18.07.21", "Якутск", 18, 13.3],
           ["19.07.21", "Минск", 39, 8.1],
           ["19.07.21", "Якутск", 19, 15.3]
           ],
          "weather_inf.csv")

temper, wind = average_weather_csv("weather_inf.csv", "Минск", 7)
print(f'Средняя температура = {temper}, средняя скорость ветра = {wind}')
