#Даны действительные числа x и y. Получить |1x+| −|x|yy|
x = 6
y = 3
print((x-y)/((x*y)+1))
