# Задача 1.2
# Даны действительные числа x и y.
# Получить (|x|-|y|) / (1 + |xy|)

x = -7.54
y = 71

eval_ = (abs(x) - abs(y)) / (1 + abs(x * y))

print(f'x = {x}, y = {y} \n',
      f'(|x|-|y|) / (1 + |xy|) = {eval_}', sep="")
