# Задание 2_3
# Дана длина ребра куба. Найти объём куба и площадь его боковой поверхности

rebro = 4
v = rebro ** 3
s = rebro * rebro
print(v, s)
