# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.
# Задание 1

a = 5
b = 2
summa = a + b
div = a / b
mult = a * b
print("Сумма равна:", summa)
print("Разность равна:", div)
print("Произведение равно:", mult)
