# Задание 3_1
# Ввести с клавиатуры имя пользователя
# Вывести на экран 'Hello, [name]!'

name = input('Имя пользователя: ')
print(f'Hello, {name}!')
