# Даны два действительных числа. Найти среднее арифметическое и
# среднее геометрическое этих чисел


a = 4
b = 5

arithmetic_mean = (a + b) / 2
print(arithmetic_mean)

geometric_mean = (a * b) ** 0.5
print(geometric_mean)
