#Создать строку равную предпоследнему символу введенной строки.
st = 'anastasia mila ramy'
hw2_2 = st[-2]
print(f" {st} \n {hw2_2} ")
