""" Дана длина ребра куба. Найти объем куба и площадь его боковой
поверхности."""

long_cube_adge = 2
cube_volume = long_cube_adge ** 3
cube_area_adge = long_cube_adge ** 2
print(cube_volume, cube_area_adge)
