# 4)Даны два действительных числа. Найти среднее арифметическое и
# среднее геометрическое этих чисел
a = 6
b = 7
c = (a + b) / 2
print(c)
d = (a * b) ** (1 / 2)
print(d)
