#Создать строку равную первым пяти символам введенной строки
st = 'anastasia mila ramy'
hw2_3 = st[0: 5]
print(f" {st} \n {hw2_3} ")
