# Дан список целых чисел. Подсчитать сколько четных чисел в списке

build_list = [1, 2, 3, 4]
print(len(build_list))