# Создать строку равную введенной строку без последних двух символов.
str1 = "Hello**World"
str2 = str1[0:len(str1) - 1]
print(str2)
