"""
Создать переменные firstname, lastname, age
с соответствующими значениями Путем сложения получить строку вида
Привет, меня зовут Иван Иванов, мне 35 лет
"""
firstname = "Yosuman"
lastname = "Kasimova"
age = "26"
print("Привет, меня зовут " + firstname + " " + lastname + "," + " мне " + age + " лет")
